<?php
// +----------------------------------------------------------------------
// | 代码生成器 php  生成的摸版文件这个摸版文件可以进行修改 如果此文件存在自动生成器将
// | 不会生成该文件。
// +----------------------------------------------------------------------
// | 最新更新时间: 2019-07-06 17:09:44
// +-----------------------------------------------------------------------
// | Author: tanshenxiao
// +-----------------------------------------------------------------------

namespace app\common\generate\admin\validate;

use think\Validate;

class BaseValidateTsx extends Validate{
    //定义验证规则
    protected $rule = [
        
           'name|名称' => 'required',
        
    ];

    //定义场景消息
    protected $message  =   [
        
            'name.requiree' => '名字必填',
        
    ];

    //验证场景
    protected $scene = [
        
    ];
}