<?php
// +----------------------------------------------------------------------
// | 代码生成器 php 生成的摸版文件这个摸版文件可以进行修改 如果此文件存在自动生成器将
// | 不会生成该文件。
// +----------------------------------------------------------------------
// | 最新更新时间: 2019-07-05 17:12:18
// +-----------------------------------------------------------------------
// | Author: tanshenxiao
// +-----------------------------------------------------------------------

namespace app\temp_test\api;


use app\temp_test\api_controller\BaseTest098f6bcd4621d373cade4e832627b4f6;


class Test098f6bcd4621d373cade4e832627b4f6 extends BaseTest098f6bcd4621d373cade4e832627b4f6
{

}
