// +----------------------------------------------------------------------
// | 代码生成器 php 基础摸版文件 注意该文件不可以修改他随时都在发生变化
// +----------------------------------------------------------------------
// | 最新更新时间: {$change_date}
// +-----------------------------------------------------------------------
// | Author: tanshenxiao
// +-----------------------------------------------------------------------

namespace {$namespace};

use think\Db;
use think\App;
{foreach $use as $item }
use {$item};
{/foreach}
//---flag_use---- 添加used标记

/**
* [Final] 基类不可以修改
*/
class {$class_name} extends {$extends_class}

{

}
