// +----------------------------------------------------------------------
// | 代码生成器 php 基础消校验器摸版文件 注意该文件不可以修改，他随时都在发生变化
// +----------------------------------------------------------------------
// | 最新更新时间: {$change_date}

// +-----------------------------------------------------------------------
// | Author: tanshenxiao
// +-----------------------------------------------------------------------

namespace {$namespace};

{volist name='use' id='item'}
use {$item};
{/volist}

class {$class_name} extends {$extends_class}

{

}